Examinator/src/ChartsOfCharacteristicTypes/ПеременныеШаблоновСообщенийСУО/ПеременныеШаблоновСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПеременныеШаблоновСообщенийСУО</name>
  <type>
    <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
    <types>CatalogRef.КаталогМероприятийСУО</types>
    <types>CatalogRef.ЛитератураСУО</types>
    <types>CatalogRef.АудиторииСУО</types>
    <types>Boolean</types>
    <types>CatalogRef.УчебныеГруппыСУО</types>
    <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    <types>String</types>
    <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    <types>CatalogRef.СводыЗнанийСУЗ</types>
    <types>Date</types>
    <types>Number</types>
    <types>DocumentRef.ПрохождениеОбученияСУО</types>
    <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    <types>DocumentRef.ПроведениеОбученияСУО</types>
    <types>CatalogRef.Пользователи</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>АдресДляПерехода</name>
      <description>Адрес для перехода</description>
      <code>АдресДляПерехода</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресСертификата</name>
      <description>Адрес сертификата</description>
      <code>АдресСертификата</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаДоступаПользователяКБазе</name>
      <description>Дата начала доступа пользователя к базе</description>
      <code>ДатаНачалаДоступаПользователяКБазе</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаПроведенияМероприятия</name>
      <description>Дата начала проведения мероприятия</description>
      <code>ДатаНачалаПроведенияМероприятия</code>
      <type>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаПроведенияПрограммыОбучения</name>
      <description>Дата начала проведения программы обучения</description>
      <code>ДатаНачалаПроведенияПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаПрохожденияМероприятия</name>
      <description>Дата начала прохождения мероприятия</description>
      <code>ДатаНачалаПрохожденияМероприятия</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияДоступаПользователяКБазе</name>
      <description>Дата окончания доступа пользователя к базе</description>
      <code>ДатаОкончанияДоступаПользователяКБазе</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияПроведенияМероприятия</name>
      <description>Дата окончания проведения мероприятия</description>
      <code>ДатаОкончанияПроведенияМероприятия</code>
      <type>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияПроведенияПрограммыОбучения</name>
      <description>Дата окончания проведения программы обучения</description>
      <code>ДатаОкончанияПроведенияПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияПрохожденияМероприятия</name>
      <description>Дата окончания прохождения мероприятия</description>
      <code>ДатаОкончанияПрохожденияМероприятия</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ЗавершеноВПроцентах</name>
      <description>Завершено в процентах</description>
      <code>ЗавершеноВПроцентах</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>Книга</name>
      <description>Книга</description>
      <code>Книга</code>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </items>
    <items>
      <name>КодПодтверждения</name>
      <description>Код подтверждения</description>
      <code>КодПодтверждения</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>КоличествоЗавершенныхМероприятий</name>
      <description>Количество завершенных мероприятий</description>
      <code>КоличествоЗавершенныхМероприятий</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоЗавершенныхТестов</name>
      <description>Количество завершенных тестов обучения</description>
      <code>КоличествоЗавершенныхТестов</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоЗавершенныхЭлектронныхКурсов</name>
      <description>Количество завершенных электронных курсов обучения</description>
      <code>КоличествоЗавершенныхЭлектронныхКурсов</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоОтправленныхНаПроверкуЗаданий</name>
      <description>Количество отправленных на проверку заданий обучения</description>
      <code>КоличествоОтправленныхНаПроверкуЗаданий</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоПроверенныхЗаданий</name>
      <description>Количество проверенных заданий обучения</description>
      <code>КоличествоПроверенныхЗаданий</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоСообщений</name>
      <description>Количество сообщений</description>
      <code>КоличествоСообщений</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ЛогинПользователя</name>
      <description>Логин пользователя</description>
      <code>ЛогинПользователя</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Мероприятие</name>
      <description>Мероприятие</description>
      <code>Мероприятие</code>
      <type>
        <types>CatalogRef.КаталогМероприятийСУО</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>Месторасположение</name>
      <description>Месторасположение</description>
      <code>Месторасположение</code>
      <type>
        <types>CatalogRef.АудиторииСУО</types>
      </type>
    </items>
    <items>
      <name>НаименованиеЗадания</name>
      <description>Наименование задания</description>
      <code>НаименованиеЗадания</code>
      <type>
        <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </items>
    <items>
      <name>НаименованиеОбучения</name>
      <description>Наименование обучения</description>
      <code>НаименованиеОбучения</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>НаименованиеПрограммыОбучения</name>
      <description>Наименование программы обучения</description>
      <code>НаименованиеПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>НовыйПароль</name>
      <description>Новый пароль</description>
      <code>НовыйПароль</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОбъединенныеЛогины</name>
      <description>Объединенные логины</description>
      <code>ОбъединенныеЛогины</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОценкаЗаЗадание</name>
      <description>Оценка за задание</description>
      <code>ОценкаЗаЗадание</code>
      <type>
        <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      </type>
    </items>
    <items>
      <name>ОценкаЗаОбучение</name>
      <description>Оценка за обучение</description>
      <code>ОценкаЗаОбучение</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ПинКод</name>
      <description>Пин-код</description>
      <code>ПинКод</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Пользователь</name>
      <description>Пользователь</description>
      <code>Пользователь</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПрограммаОбучения</name>
      <description>Программа обучения</description>
      <code>ПрограммаОбучения</code>
      <type>
        <types>CatalogRef.КаталогПрограммОбученияСУО</types>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ПродолжительностьОбучения</name>
      <description>Продолжительность обучения</description>
      <code>ПродолжительностьОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ПродолжительностьПрограммыОбучения</name>
      <description>Продолжительность программы обучения</description>
      <code>ПродолжительностьПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>УчебнаяГруппа</name>
      <description>Учебная группа</description>
      <code>УчебнаяГруппа</code>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Examinator/src/Enums/ТипыАвтоматическихРассылокСУО/ТипыАвтоматическихРассылокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАвтоматическихРассылокСУО</name>
  <enumValues>
    <name>ПриЗачисленииНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриЗачисленииНаПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытоеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытуюПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНазначенииПреподавателяНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхЛичныхСообщений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхТемФорума</name>
  </enumValues>
  <enumValues>
    <name>ПриОтправкеЗаданияНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ВажнаяНовость</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеПароля</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНовогоПользователя</name>
  </enumValues>
  <enumValues>
    <name>ПередОкончаниемДоступаКБазе</name>
  </enumValues>
  <enumValues>
    <name>ПриОбновленииОтбораПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПослеПроверкиЗаданияПреподавателем</name>
  </enumValues>
  <enumValues>
    <name>ПослеВозвратаНаДоработкуЗадания</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/ChartsOfCharacteristicTypes/ПеременныеШаблоновСообщенийСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТаблицаПодсказок() Экспорт
	
	ТаблицаПодсказок = Новый ТаблицаЗначений;
	ТаблицаПодсказок.Колонки.Добавить("Переменная");
	ТаблицаПодсказок.Колонки.Добавить("Подсказка");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода;
	НоваяСтрока.Подсказка = НСтр("ru = 'Гиперссылка, пройдя по которой, можно установить новый пароль. Сервис восстановления пароля доступен только в веб-кабинете'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата регистрации пользователя в информационной базе'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, указанная в настройках проведения обучения в поле ""Обучение с...""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Самая ранняя из дат, указанных в поле ""Обучение с..."" настроек всех проведений обучения, входящих в программу обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПрохожденияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, когда обучающийся впервые открыл электронные курс, тест или файлы назначенного ему проведения обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, указанная в поле ""Доступ по..."" на форме ""Пользователь"", команда ""Время доступа""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, указанная в настройках проведения обучения в поле ""Обучение по...""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Самая поздняя из дат, указанных в поле ""Обучение по..."" настроек всех проведений обучения, входящих в данную программу обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПрохожденияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, когда участнику проведения обучения был автоматически или вручную установлен статус ""Завершил""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЗавершеноВПроцентах;
	НоваяСтрока.Подсказка = НСтр("ru = 'Процент изученных элементов электронного курса'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Книга;
	НоваяСтрока.Подсказка = НСтр("ru = 'Книга, которую необходимо вернуть'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Код подтверждения, который потребуется указать при восстановлении пароля через веб-кабинет, если пользователь забыл пароль'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхМероприятий;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество завершенных подчиненных обучений. Используется только для обучений, содержащих подчиненные'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхТестов;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество завершенных тестов (в составе электронного курса или отдельно), выполненных обучающимся в ходе электронного обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхЭлектронныхКурсов;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество электронных курсов, пройденных обучающимся в ходе электронного обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоОтправленныхНаПроверкуЗаданий;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество заданий, включая тесты с открытыми ответами, которые отправил на проверку обучающийся с начала обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаЗадание;
	НоваяСтрока.Подсказка = НСтр("ru = 'Оценка пользователя за выполненное им задание'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаОбучение;
	НоваяСтрока.Подсказка = НСтр("ru = 'Оценка пользователя за пройденное обучение'");	
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоПроверенныхЗаданий;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество заданий, включая тесты с открытыми ответами, которые проверил преподаватель с начала обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоСообщений;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество непрочитанных личных сообщений или непрочитанных сообщений в теме форума'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя;
	НоваяСтрока.Подсказка = НСтр("ru = 'Логин пользователя для входа в программу или веб-кабинет'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Мероприятие;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование мероприятия'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение;
	НоваяСтрока.Подсказка = НСтр("ru = 'Месторасположение аудитории, в которой проходит обучение'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование проведения обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеЗадания;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование электронного задания'");	
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование проведения программы обучения'");	
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НовыйПароль;
	НоваяСтрока.Подсказка = НСтр("ru = 'Новый случайный пароль, который сообщается пользователю при настройке доступа в программу через форму ""Управление доступом""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОбъединенныеЛогины;
	НоваяСтрока.Подсказка = НСтр("ru = 'Список логинов учетных записей пользователя, которые были объединены в одну учетную запись'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПинКод;
	НоваяСтрока.Подсказка = НСтр("ru = 'Пин-код обучающегося'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь;
	НоваяСтрока.Подсказка = НСтр("ru = 'Полное имя пользователя, указанное в одноименном поле формы ""Пользователь""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПрограммаОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование программы обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Продолжительность обучения, заданная в настройках Проведения обучения ""С начала обучения"", ""С зачисления"" или вычисленная для фиксированных С... По...'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Длительность программы обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа;
	НоваяСтрока.Подсказка = НСтр("ru = 'Учебная группа пользователя. Если групп несколько, то перечисляются через запятую'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресСертификата;
	НоваяСтрока.Подсказка = НСтр("ru = 'Адрес (URL) выданного сертификата за пройденное обучение. Доступно только в веб-кабинете'");
	
	
	Возврат ТаблицаПодсказок;
	
КонецФункции

Функция ПодсказкаКПеременной(Переменная, ТаблицаПодсказок = Неопределено) Экспорт
	
	Если ТаблицаПодсказок = Неопределено Тогда
		ТаблицаПодсказок = ТаблицаПодсказок();
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаПодсказок.Найти(Переменная, "Переменная");
	
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат НайденнаяСтрока.Подсказка;
	КонецЕсли;
	
КонецФункции

Функция КодПеременной(Переменная) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Переменная, "Код");
КонецФункции

Функция ТаблицаПеременныхАвтоматическойРассылки(ТипАвтоматическойРассылки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеременныеШаблоновСообщенийСУО.Ссылка КАК Переменная,
		|	ПеременныеШаблоновСообщенийСУО.Код
		|ИЗ
		|	ПланВидовХарактеристик.ПеременныеШаблоновСообщенийСУО КАК ПеременныеШаблоновСообщенийСУО";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ТаблицаПодсказок = ТаблицаПодсказок();
	
	ТаблицаПеременных = Новый ТаблицаЗначений;
	ТаблицаПеременных.Колонки.Добавить("Переменная");
	ТаблицаПеременных.Колонки.Добавить("Код");
	ТаблицаПеременных.Колонки.Добавить("Подсказка");	
	
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	ПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость Тогда
		// Не требуется
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоСообщений, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания
		ИЛИ ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем
		ИЛИ ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхТестов, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхЭлектронныхКурсов, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоОтправленныхНаПроверкуЗаданий, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоПроверенныхЗаданий, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеЗадания, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаЗадание, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);	
		КонецЕсли;		
	КонецЕсли;	
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаОбучение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресСертификата, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		КонецЕсли;										
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияПрограммыОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);									
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);										
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);									
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);									
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПрограммаОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияПрограммыОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
	КонецЕсли;	
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.РегистрацияНовогоПользователя Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
		
	Возврат ТаблицаПеременных;
	
КонецФункции

Процедура ЗаполнитьСтрокуТаблицыПеременных(Переменная, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок)
	
	НоваяСтрока = ТаблицаПеременных.Добавить();
	НоваяСтрока.Переменная = Переменная;
	НоваяСтрока.Код = ТаблицаДанных.Найти(НоваяСтрока.Переменная, "Переменная").Код;
	НоваяСтрока.Подсказка = ПодсказкаКПеременной(НоваяСтрока.Переменная, ТаблицаПодсказок);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
